package ch_07_data_class

/**
 * fileName       : `03`
 * date           : 2024-04-17
 * time           : 오후 2:31
 * ===========================================================
 * description    :
 */

fun main() {
    /*
    4. 접근 제한자
    접근 제한자는 "누구에게 클래스의 메서드와 변수를 공개할 것인가?"를 정하는 것.
    코틀린 클래스의 기본 속성과 메서드는 public.
    public 이외에도 private, protected, internal 접근 제한자가 있음.

    각각의 접근 제한자가 공개하는 범위는 다음과 같음.
    public : 코틀린의 기본 접근 제한자. 어디서나 접근 가능.
    internal : 같은 모듈 내에서 접근 가능.
    안드로이드 개발 시에는 한 프로젝트 안에 있으면 같은 모듈이라고 보면 됨.
    만약 한 프로젝트에 여러 모듈을 만든다면 이는 모듈 간 접근이 제한.
    protected : 자식 클래스에서는 접근할 수 있음.
    private : 해당 클래스 내부에서만 접근할 수 있음.

    접근 제한자는 다음과 같이 변수나 메서드 앞에 써주면 됨.
     */

}